nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/driver_examples/lpuart/hardware_flow_control/pin_mux.c
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXW70ACxxx
package_id: MCXW70ACMFT
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPUART_1, signal: RX, pin_signal: PTC2/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM4_CH1, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '40', peripheral: LPUART_1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM0_CLKIN, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '12', peripheral: LPUART_0, signal: TX, pin_signal: ADC0_A5/PTA17/LPSPI0_SIN/EWM0_IN/LPI2C0_SDAS/LPUART0_TX/RF_GPO_7/RF_GPO_8/PWM0_B0, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '14', peripheral: LPUART_0, signal: RTS, pin_signal: CMP0_IN1/PTA19/LPSPI0_SCK/LPUART0_RTS_b/LPI2C0_SCL/RF_GPO_1/PWM0_B1, pull_select: down, pull_enable: disable,
    slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '11', peripheral: LPUART_0, signal: RX, pin_signal: ADC0_A4/PTA16/LPSPI0_PCS0/EWM0_OUT_b/LPI2C0_SCLS/LPUART0_RX/RF_GPO_8/PWM0_A0, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '13', peripheral: LPUART_0, signal: CTS, pin_signal: PTA18/LPSPI0_SOUT/LPUART0_CTS_b/LPI2C0_SDA/RF_GPO_0/PWM0_A1/LPUART0_RX, pull_select: down, pull_enable: disable,
    slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t port_a16_pin11_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = (uint16_t)kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                     /* Pin is configured as LPUART0_RX */
                                                     .mux = (uint16_t)kPORT_MuxAlt6,
                                                     /* Digital input is not inverted */
                                                     .invertInput = (uint16_t)kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A16 (pin 11) is configured as LPUART0_RX */
    PORT_SetPinConfig(PORT_A, 16U, &port_a16_pin11_config);

    const port_pin_config_t port_a17_pin12_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = (uint16_t)kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                     /* Pin is configured as LPUART0_TX */
                                                     .mux = (uint16_t)kPORT_MuxAlt6,
                                                     /* Digital input is not inverted */
                                                     .invertInput = (uint16_t)kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A17 (pin 12) is configured as LPUART0_TX */
    PORT_SetPinConfig(PORT_A, 17U, &port_a17_pin12_config);

    const port_pin_config_t port_a18_pin13_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = (uint16_t)kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                     /* Pin is configured as LPUART0_CTS_b */
                                                     .mux = (uint16_t)kPORT_MuxAlt3,
                                                     /* Digital input is not inverted */
                                                     .invertInput = (uint16_t)kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A18 (pin 13) is configured as LPUART0_CTS_b */
    PORT_SetPinConfig(PORT_A, 18U, &port_a18_pin13_config);

    const port_pin_config_t port_a19_pin14_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = (uint16_t)kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                     /* Pin is configured as LPUART0_RTS_b */
                                                     .mux = (uint16_t)kPORT_MuxAlt3,
                                                     /* Digital input is not inverted */
                                                     .invertInput = (uint16_t)kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A19 (pin 14) is configured as LPUART0_RTS_b */
    PORT_SetPinConfig(PORT_A, 19U, &port_a19_pin14_config);

    const port_pin_config_t port_c2_pin39_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPUART1_RX */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinConfig(PORT_C, 2U, &port_c2_pin39_config);

    const port_pin_config_t port_c3_pin40_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPUART1_TX */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinConfig(PORT_C, 3U, &port_c3_pin40_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
